export const NavigationData = [
  {
    title: '新闻网站',
    children: [
      [
        '人民日报',
        '<svg t="1746587939958" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2639" width="200" height="200"><path d="M512 512m-512 0a512 512 0 1 0 1024 0 512 512 0 1 0-1024 0Z" fill="#e6e6e6" p-id="2640"></path><path d="M245.76 383.249067l34.133333 16.110933s-11.127467 37.137067-17.6128 51.2-42.734933 84.3776-52.0192 99.669333-25.6 48.810667-47.786666 67.7888-47.377067 17.339733-57.685334 17.544534a140.151467 140.151467 0 0 1-28.194133-4.437334s41.710933-5.666133 57.480533-16.520533a139.605333 139.605333 0 0 0 31.197867-30.3104 376.968533 376.968533 0 0 0 20.48-35.908267L245.76 415.266133zM223.300267 544.9728a34.952533 34.952533 0 0 1 13.653333 7.850667 221.184 221.184 0 0 1 17.749333 20.48c2.389333 3.4816 13.175467 18.8416 15.9744 22.7328a32.017067 32.017067 0 0 0 24.234667 13.653333 80.896 80.896 0 0 0 25.941333-6.826667 37.546667 37.546667 0 0 1 15.633067 0s-16.861867 22.186667-35.6352 28.535467-31.3344 0.8192-36.181333-4.7104a95.573333 95.573333 0 0 1-16.042667-25.941333s-8.6016-23.210667-12.151467-31.744a124.245333 124.245333 0 0 0-8.874666-18.432 20.002133 20.002133 0 0 0-4.3008-5.597867zM391.918933 518.826667s16.7936 15.291733 19.387734 26.760533a256.068267 256.068267 0 0 1 1.160533 43.349333s16.9984-14.199467 22.391467-7.509333-0.887467 21.7088-13.653334 30.1056a278.391467 278.391467 0 0 1-27.989333 15.906133s-9.557333 3.754667-12.356267 0a38.2976 38.2976 0 0 1-5.802666-19.8656 113.4592 113.4592 0 0 1 6.144-40.96 299.076267 299.076267 0 0 0 10.717866-47.786666z" fill="#d81e06" p-id="2641"></path><path d="M397.312 472.200533a47.786667 47.786667 0 0 0 27.8528-4.096c12.9024-6.826667 37.000533-26.2144 58.914133-31.266133s31.402667-1.6384 33.041067 3.549867-10.6496 30.3104-31.744 40.96 1.8432 12.561067 3.754667 13.653333-0.887467 5.870933-4.778667 9.4208A61.986133 61.986133 0 0 1 463.0528 518.826667a182.0672 182.0672 0 0 1-25.531733 1.706666s8.3968 21.367467 12.834133 21.367467 8.874667-14.404267 9.557333-16.861867a7.5776 7.5776 0 0 1 12.424534-1.365333c6.075733 5.256533 10.24 8.055467 4.642133 14.199467s-13.1072 13.653333-13.1072 13.653333a159.470933 159.470933 0 0 0 14.9504 34.133333c7.304533 9.762133 7.5776 12.014933 13.653333-2.4576A47.786667 47.786667 0 0 0 498.346667 559.786667s-0.8192-4.983467 1.501866-4.846934a16.110933 16.110933 0 0 1 10.513067 9.216c1.501867 4.9152-2.935467 54.613333-2.935467 54.613334s0 5.051733-10.103466 5.051733-19.797333-4.3008-30.1056-18.705067a336.008533 336.008533 0 0 1-21.845334-38.2976s-16.9984 8.738133-22.254933 5.7344 16.657067-19.2512 16.657067-19.2512-11.810133-16.247467-10.6496-30.856533a35.908267 35.908267 0 0 1 13.653333-28.603733c8.465067-6.826667 36.6592-30.446933 36.6592-30.446934s4.7104-4.5056 3.549867-5.597866-32.426667 19.6608-38.161067 23.552a32.631467 32.631467 0 0 1-23.210667 8.6016c-10.4448-1.092267-13.653333-3.140267-16.9984-6.826667a81.373867 81.373867 0 0 1-7.304533-10.922667zM702.532267 465.988267a37.137067 37.137067 0 0 0-28.8768-15.837867c-15.7696-0.477867-18.0224 1.297067-34.542934 12.0832s-42.871467 30.788267-45.192533 35.293867 5.051733 13.653333 7.7824 18.090666 10.513067 32.085333 2.798933 39.1168-15.5648-11.332267-17.339733-23.620266a99.464533 99.464533 0 0 0-8.738133-27.306667 11.195733 11.195733 0 0 0-7.7824-5.461333 360.311467 360.311467 0 0 1-4.027734 36.0448c-2.525867 11.810133-7.304533 35.6352-9.0112 40.96a133.3248 133.3248 0 0 0 0 42.871466c2.730667 11.264 11.741867 22.528 19.0464 22.528s15.018667-9.762133 21.777067-28.330666 6.280533-16.315733 9.557333-14.5408a152.1664 152.1664 0 0 0 30.788267 19.592533c14.336 5.461333 28.330667 22.050133 31.607467 22.254933s18.295467-16.520533 21.2992-30.788266 5.7344-80.964267 6.485333-87.722667 3.822933-31.1296 8.533333-37.614933 1.570133-11.127467-4.164266-17.6128zM652.629333 578.491733c0 4.778667 0 6.280533-8.874666 2.525867a56.661333 56.661333 0 0 1-22.528-19.797333 24.439467 24.439467 0 0 1-1.6384-6.144c0-7.509333 32.836267-3.140267 32.836266-3.140267z m4.9152-76.458666c-2.321067 12.424533 1.2288 20.48-2.048 21.230933s-21.435733-8.8064-33.109333-11.946667a30.788267 30.788267 0 0 1-16.861867-10.990933 115.029333 115.029333 0 0 0 32.426667-9.898667c12.151467-6.826667 21.162667-17.8176 24.849067-15.701333s-3.003733 14.9504-5.256534 27.306667zM856.814933 360.0384a23.483733 23.483733 0 0 1-0.4096 9.284267c-1.297067 2.594133-22.664533 29.764267-24.576 34.952533s0 9.284267-6.075733 12.765867-25.053867 7.7824-36.0448 11.605333-12.0832 8.669867-11.400533 9.557333 27.784533 7.9872 27.306666 10.990934a101.034667 101.034667 0 0 1-13.653333 16.9984 249.582933 249.582933 0 0 0 46.421333-23.688534c14.472533-11.264 27.306667-24.644267 28.8768-30.856533s-3.208533-11.264-0.4096-15.1552 18.158933-13.653333 16.861867-20.8896a23.552 23.552 0 0 0-18.568533-16.384c-9.147733-1.774933-8.328533 0.8192-8.328534 0.8192zM776.533333 487.6288c10.24-0.682667 20.48-14.609067 39.7312-24.9856s28.945067-8.328533 36.6592-6.826667 8.3968 6.212267 6.075734 9.489067a39.389867 39.389867 0 0 1-21.2992 19.387733 127.931733 127.931733 0 0 1-45.192534 6.075734 73.181867 73.181867 0 0 1-15.9744-3.140267zM802.474667 501.009067c0-3.549867 2.116267-7.441067 6.826666-5.3248s8.6016 9.966933 13.653334 11.810133 15.36 0 15.223466 6.826667-0.546133 7.714133-4.846933 11.0592-12.6976 9.898667-11.127467 14.5408 4.642133 0.8192 5.9392-2.184534 3.413333-6.826667 5.870934-6.826666 9.352533 1.4336 6.3488 10.922666a40.96 40.96 0 0 1-17.134934 21.9136c-8.192 5.461333-9.079467 5.3248-9.762133 8.874667a349.047467 349.047467 0 0 0-6.826667 34.952533c-0.750933 9.352533 0 26.897067 0 31.675734s0.8192 9.489067-3.754666 9.489066h-12.356267c-4.027733 0-9.489067-8.055467-9.489067-16.520533s6.826667-21.162667 6.826667-24.7808 0-4.5056-0.682667-5.051733-2.4576 0-10.990933 8.6016-58.641067 48.5376-58.641067 48.5376A7.918933 7.918933 0 0 1 709.973333 662.186667a36.0448 36.0448 0 0 1-11.332266-7.236267c-1.774933-1.6384-6.826667-6.826667-1.2288-9.966933s28.0576-18.6368 39.594666-27.784534 46.557867-30.583467 52.770134-44.373333a64.170667 64.170667 0 0 0 4.778666-31.9488c-0.477867-4.096-5.9392-11.332267-5.802666-14.7456s14.336-12.151467 14.472533-14.882133-0.750933-10.24-0.750933-10.24zM869.376 433.220267a109.636267 109.636267 0 0 1 30.583467-20.0704 58.1632 58.1632 0 0 1 31.9488-1.297067s-38.638933 75.093333-44.8512 90.180267-16.384 37.341867-20.957867 49.425066-9.079467 22.254933-9.284267 25.053867 1.979733 3.549867 4.573867-1.570133a216.4736 216.4736 0 0 1 33.723733-39.5264 295.7312 295.7312 0 0 0 37.410134-40.004267c3.8912-6.826667 4.164267-11.810133 7.5776-13.653333s14.1312 9.216 14.813866 14.062933 5.5296 17.134933-12.0832 25.6-26.760533 7.645867-37.546666 12.561067a52.8384 52.8384 0 0 0-20.48 14.9504c-2.594133 3.618133-1.8432 4.3008-0.8192 5.7344a39.799467 39.799467 0 0 0 10.308266 11.537066c6.826667 5.597867 20.48 13.653333 27.648 23.005867a44.714667 44.714667 0 0 1 9.762134 22.869333c0.887467 6.3488-20.957867 3.8912-27.306667-1.8432s-12.356267-23.005867-14.5408-31.197866-1.979733-17.134933-6.826667-17.885867-13.653333 9.966933-16.725333 17.681067a321.262933 321.262933 0 0 1-13.653333 34.816c-4.437333 6.826667-7.168 11.400533-9.216 11.127466S832.853333 616.2432 832.853333 612.5568s5.3248-7.3728 13.653334-38.7072a779.8784 779.8784 0 0 1 27.306666-87.790933 238.933333 238.933333 0 0 1 17.339734-34.133334c2.4576-3.003733 5.5296-8.3968-0.8192-8.260266s-20.957867-10.4448-20.957867-10.4448z" fill="#d81e06" p-id="2642"></path></svg>',
        '不用https 又怎样？！对于一个普通的劳动人民，他一定是想让你过的好的',
        'http://www.people.com.cn/'
      ],
      ['tiobeIndex', 'https://www.tiobe.com/wp-content/themes/tiobe/favicon/favicon.ico', '编程语言流行度排名，是存量排名', 'https://www.tiobe.com/tiobe-index/']
    ]
  },
  {
    title: '开发者社区',
    children: [
      [
        'Dev',
        'https://res.cloudinary.com/practicaldev/image/fetch/s--E8ak4Hr1--/c_limit,f_auto,fl_progressive,q_auto,w_32/https://dev-to.s3.us-east-2.amazonaws.com/favicon.ico',
        '这里有许多优秀的技术博客，csharp和前端，或者工具，但是关于c/cpp的很少',
        'https://dev.to/'
      ],
      [
        'geeksforgeeks',
        'https://media.geeksforgeeks.org/gfg-gg-logo.svg',
        '这里有很多教程，有些质量非常高，比如关于数据结构和算法，但似乎有些杂乱，这个网站一直安利付费课程',
        'https://www.geeksforgeeks.org/'
      ],
      ['DZone', 'https://dz2cdn1.dzone.com/themes/dz20/images/favicon.png', '有许多优秀的学习资源，和优秀的博客，特别是关于devops和系统设计，c/c++内容较少', 'https://dzone.com'],
      [
        'Conventional Commits',
        'https://www.conventionalcommits.org/favicon.ico',
        'git commit 非常重要，按照这里的约定去写git commit message',
        'https://www.conventionalcommits.org/'
      ]
    ]
  },

  {
    title: 'git 仓库',
    children: [
      [
        'Github',
        '<svg role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>GitHub</title><path d="M12 .297c-6.63 0-12 5.373-12 12 0 5.303 3.438 9.8 8.205 11.385.6.113.82-.258.82-.577 0-.285-.01-1.04-.015-2.04-3.338.724-4.042-1.61-4.042-1.61C4.422 18.07 3.633 17.7 3.633 17.7c-1.087-.744.084-.729.084-.729 1.205.084 1.838 1.236 1.838 1.236 1.07 1.835 2.809 1.305 3.495.998.108-.776.417-1.305.76-1.605-2.665-.3-5.466-1.332-5.466-5.93 0-1.31.465-2.38 1.235-3.22-.135-.303-.54-1.523.105-3.176 0 0 1.005-.322 3.3 1.23.96-.267 1.98-.399 3-.405 1.02.006 2.04.138 3 .405 2.28-1.552 3.285-1.23 3.285-1.23.645 1.653.24 2.873.12 3.176.765.84 1.23 1.91 1.23 3.22 0 4.61-2.805 5.625-5.475 5.92.42.36.81 1.096.81 2.22 0 1.606-.015 2.896-.015 3.286 0 .315.21.69.825.57C20.565 22.092 24 17.592 24 12.297c0-6.627-5.373-12-12-12"/></svg>',
        '非常多的优秀项目,它的推荐系统很好，来利用它开视野吧！',
        'https://github.com'
      ],
      [
        'Coding',
        'https://coding-net-production-pp-ci.codehub.cn/9837b4a6-442b-4513-b51d-a2030c4a6ede.png',
        '腾讯云的软件开发管理平台，公司级项目可选，私有化部署付费，个人还是用github好些',
        'https://coding.net/'
      ],
      [
        'Codeberg',
        'https://codeberg.org/assets/img/favicon.svg',
        'github 的替代品，如果不想使用github,这是另外一个选择，相比github，资源少，也没有推荐系统，但作者表示永远开源不会商业化',
        'https://codeberg.org/'
      ],
      [
        'Forgejo',
        'https://forgejo.org/favicon.svg',
        '私有化部署就选它了，比gitlab占用资源少，codeberg用的就是它，CI/CD生态和github基本一致，fork from gitea',
        'https://forgejo.org/'
      ],
      ['码云', 'https://gitee.com/favicon.ico', '国内仓库，基本和死差不多了。。。不翻墙上网可选，我有一些项目在上面', 'https://gitee.com/'],
      ['kde仓库', 'https://invent.kde.org/uploads/-/system/appearance/favicon/1/kde-logo-white-blue-128x128.png', 'kde仓库，应该是使用gitlab', 'https://invent.kde.org/']
    ]
  },
  {
    title: '视频网站',
    children: [
      ['youtube', 'https://www.youtube.com/s/desktop/014dbbed/img/favicon_48x48.png', '有许多高质量的视频教程', 'https://www.youtube.com'],
      ['B站', 'https://static.hdslb.com/mobile/img/512.png', '娱乐视频，有一些学习视频', 'https://www.bilibili.com']
    ]
  },
  {
    title: '前端',
    children: [
      ['vue', 'https://vuejs.org/logo.svg', '如果是使用vue，仅官方网站的文档就够用了,vue 全家桶(1/3) vue core', 'https://vuejs.org/'],
      ['vue-router', 'https://vuejs.org/logo.svg', '前端路由，vue 全家桶(2/3) vue router', 'https://router.vuejs.org/'],
      ['pinia', 'https://pinia.vuejs.org/logo.svg', '全局状态管理，大型项目更偏向使用，vue 全家桶(3/3) pinia ', 'https://pinia.vuejs.org/'],
      ['naive-ui', 'https://www.naiveui.com/assets/naivelogo-BdDVTUmz.svg', '很有意思的vue 组件库,优雅，项目质量天花板的高', 'https://www.naiveui.com/'],
      ['t-Design', 'https://cdc.cdn-go.cn/tdc/latest/images/tdesign.svg', '腾讯出的全家桶组件库，非常适合团队项目使用,功能十分强大', 'https://tdesign.tencent.com/']
    ]
  },
  {
    title: '数据结构、算法和数学',
    children: [['Hello 算法', 'https://www.hello-algo.com/assets/images/favicon.png', '对于基本的数据结构和算法，不需要其它的了，免费，强大！', 'https://www.hello-algo.com/']]
  },
  {
    title: 'c/c++',
    children: [
      ['isocpp', 'https://isocpp.org/favicon.ico', 'cpp官网？cpp的最新信息和资源', 'https://isocpp.org/'],
      ['cppreference', 'https://en.cppreference.com/favicon.ico', '权威c/c++参考网站', 'https://en.cppreference.com/'],

      ['Learncpp', 'https://www.learncpp.com/blog/wp-content/uploads/learncpp.png', '系统学习c++语法的最佳网站，你不需要别的参考书了', 'https://www.learncpp.com/'],

      ['pvs-studio', 'https://cdn.pvs-studio.com/static/favicon.ico', 'c/c++,c#的一个静态分析工具，非常优秀的工程师，此网站还有许多优秀的博客内容！', 'https://pvs-studio.com/'],
      ['c++module', 'https://arewemodulesyet.org/favicon.ico', 'c++module进度，看样子普遍用上module还要好长时间🤣...至少等clangd支持了再说吧', 'https://arewemodulesyet.org/'],
      ['gdb debugger', 'https://sourceware.org/gdb/images/archer-fish.ico', 'gdb 的网站，有写的很详细的文档', 'https://sourceware.org/gdb/'],
      ['C++ Core Guidelines', 'https://isocpp.github.io/CppCoreGuidelines/cpp_core_guidelines_16b.png', '创造C++的那些人，告诉你如何使用c++', 'https://isocpp.github.io/'],
      [
        'SEC CERT C++',
        'https://wiki.sei.cmu.edu/confluence/s/-a00b01/9012/5bulwo/7/_/favicon.ico',
        '大名鼎鼎的CMU 安全c++编程规范，重要的是理解为什么',
        'https://wiki.sei.cmu.edu/'
      ],
      [
        'Learn Modern C++',
        'https://learnmoderncpp.com/wp-content/uploads/2022/11/cropped-bitmap.png?w=192',
        '有非常优秀的关于 mordern cpp的 blog,可以作为learncpp的补充',
        'https://learnmoderncpp.com'
      ]
    ]
  },
  {
    title: '论坛&工具',
    children: [
      [
        'Compliler Explorer',
        'https://godbolt.org/favicon.ico?v=1',
        '你的代码编译之后的样子?通产是各种中间码和汇编码，你可能更关注c/c++ zig等系统级编程语言',
        'https://godbolt.org/'
      ],
      ['词根词缀词典', 'https://www.dicts.cn/favicon.ico', '超级好用的词根词缀词典，作者是个自由开发者', 'https://www.dicts.cn/']
    ]
  },
  {
    title: '软件工程',
    children: [
      [
        'REFACTORING',
        'https://refactoring.guru/favicon.png',
        '在这个网站中可以学习到设计模式和代码重构，质量非常好，钱相对充足的时候去支持一下作者，可以微信支付宝。',
        'https://refactoring.guru/'
      ]
    ]
  },
  {
    title: '资源网站',
    children: [
      ['cloudflare', 'https://dash.cloudflare.com/favicon.ico', '活菩萨！！！ 好用的ssl服务，静态网页托管(github 仓库直连)，数据库，完全免费！', 'https://dash.cloudflare.com/'],

      [
        'Coursela',
        'https://d3njjcbhbojbot.cloudfront.net/web/images/favicons/favicon-v2-32x32.png',
        '人间充满爱的学习平台,质量很高。能在这里找的学习资源，就在这里找吧，很多免费的资源，付费也完全值得，将来有机会的话，可以在这里申请硕士学位，前提是钱和时间都要有',
        'https://www.coursera.org/'
      ],
      ['csdiy', 'https://csdiy.wiki/images/favicon.ico', '计算机自学网站，都是硬核的东西，作者是北大的博士生，学习一点就够了', 'https://csdiy.wiki/'],
      [
        'leanhub',
        'https://leanpub.com/assets/favicons/favicon-32x32-9a0898109481d6450269c966cdf6a2d7.png',
        '书店。从isocpp可以看到许多优秀的作者在那里卖书，需要用美元支付，有机会办个境外支付的卡',
        'https://leanpub.com/'
      ],
      ['Udemy', 'https://www.udemy.com/staticx/udemy/images/v8/favicon-32x32.png', '优秀的课程网站，比Coursela资源多', 'https://www.udemy.com/'],
      [
        'z-library',
        `<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="48" height="48" rx="4" fill="white"/>
<path d="M16.5635 5.5177L23.1434 25.4927L23.1463 25.4916L23.2292 25.7334C23.5446 25.6031 23.8863 25.5243 24.2479 25.519C24.6351 25.5126 25.009 25.5891 25.3542 25.7299L25.4336 25.5097L25.4465 25.5143L31.7921 5.5177H31.4025L25.186 25.0862L29.0603 5.5177H28.6824L24.8886 24.6259L26.7052 5.5177H26.332L24.478 25.1668C24.4511 25.165 24.4255 25.161 24.3986 25.1598L24.4383 25.1592L24.5551 5.5177H24.1819L24.0656 25.165H24.075C24.0586 25.1662 24.0429 25.1691 24.0265 25.1703L22.401 5.5177H22.0266L23.613 24.8087L19.4519 5.5177H19.0716L23.1246 24.3082L16.9554 5.5177H16.5635V5.5177Z" fill="#C7C6C7"/>
<path d="M26.2748 44.2895V32.4615H22.0815V44.2895L24.1779 42.1318L26.2748 44.2895Z" fill="#49AFD0"/>
<path d="M37.7385 4.2002L32.7492 5.51793L25.2961 25.7108H23.2424L15.8202 5.41044L10.7993 4.2002L20.4206 30.3462L28.2148 30.3538L37.7385 4.2002Z" fill="#626062"/>
</svg>`,
        '可以下载很多盗版书，有机会还是买正版书吧...',
        'https://z-library-zlibgs.github.io/'
      ]
    ]
  }
];
